In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from scipy.stats import norm
from sklearn.preprocessing import StandardScaler
from scipy import stats
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [12]:
ar1=np.array([1,2,3,np.nan,5,6,7,np.nan,8,np.nan,np.nan,np.nan]).reshape(4,3)
ar1

array([[ 1.,  2.,  3.],
       [nan,  5.,  6.],
       [ 7., nan,  8.],
       [nan, nan, nan]])

In [18]:
dt=pd.DataFrame(ar1)
dt.dropna()                    # drop all rows with Null value

     0    1    2
0  1.0  2.0  3.0

In [19]:
dt.dropna(axis=1)      # drop all cols with null value

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [22]:
dt.dropna(how='all')        # drop row with all as null values

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0

In [24]:
dt.dropna(how='any')

     0    1    2
0  1.0  2.0  3.0

In [ ]:
dt.drop()

In [36]:
dt.dropna(thresh=1)    # any row which has minimum 1 value

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0

In [38]:
dframe=pd.DataFrame(np.arange(16).reshape(4,4),index=[[1,1,2,2],['a','b','a','b']])
dframe

      0   1   2   3
1 a   0   1   2   3
  b   4   5   6   7
2 a   8   9  10  11
  b  12  13  14  15

In [39]:
dframe=pd.DataFrame(np.arange(16).reshape(4,4),index=[[1,1,2,2],['a','b','a','b']],columns=[['Bangalore','Nagpur','Nagpur','Nagpur'],['Cold','Hold','Cold','Rainy']])
dframe

    Bangalore Nagpur
         Cold   Hold Cold Rainy
1 a         0      1    2     3
  b         4      5    6     7
2 a         8      9   10    11
  b        12     13   14    15

In [40]:
dframe['Bangalore']

     Cold
1 a     0
  b     4
2 a     8
  b    12

In [41]:
dframe['Nagpur']

     Hold  Cold  Rainy
1 a     1     2      3
  b     5     6      7
2 a     9    10     11
  b    13    14     15

In [43]:
dframe['Nagpur','Cold']

1  a     2
   b     6
2  a    10
   b    14
Name: (Nagpur, Cold), dtype: int32

In [44]:
dframe['Nagpur','Cold'][1,'b']

6

In [45]:
dframe['Nagpur','Cold'][1]

a    2
b    6
Name: (Nagpur, Cold), dtype: int32

In [60]:
a1=pd.Series([1,2,3,4,np.nan],index=['a','b','c','d','e'])
a2=pd.Series([3,np.nan,4,np.nan,np.nan],index=['a','b','c','d','e'])
a3=pd.Series(np.where(a2.isna(),a1,a2),index=a1.index)
a3

a    3.0
b    2.0
c    4.0
d    4.0
e    NaN
dtype: float64

In [62]:
a1.combine_first(a2)

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [74]:
d2=pd.DataFrame([['A',2],['A',2],['B',2],['B',3],['B',3]],columns=['Key1','Key2'])
print(d2)
d2.duplicated()

  Key1  Key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [78]:
d2.drop_duplicates("Key1")

  Key1  Key2
0    A     2
2    B     2

In [82]:
d2.drop_duplicates('Key1',keep='last')    # it check from bottom to top, and keep the first value

  Key1  Key2
1    A     2
4    B     3

In [105]:
d2=pd.DataFrame([['Gaurav',100],['Debasish',200],['Amrish',300]],columns=['Names','Weights'])
height={"Gaurav":50,'Debasish':60,'Amrish':70}

d2["height"]=d2["Names"].map(height)          # To map Values
d2

      Names  Weights  height
0    Gaurav      100      50
1  Debasish      200      60
2    Amrish      300      70